## Import libraries

In [189]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns', None)  # me muestre todas las columnas
#pd.set_option('display.max_rows', None)  # me muestre todas las filas

## Import files

In [190]:
top500 = pd.read_csv('../data/clean/DB_Kaggle_top500albums_clean.csv', encoding='latin1')
top500.head(3)

,toprankingorder,album,artist,year
0,1,Sgt. Pepper's Lonely Hearts Club Band,The Beatles,1967
1,2,Pet Sounds,The Beach Boys,1966
2,3,Revolver,The Beatles,1966

In [191]:
top500.rename(columns={'album': 'albumnamers'}, inplace=True)
top500.columns

Index(['toprankingorder', 'albumnamers', 'artist', 'year'], dtype='object')

In [192]:
spotifyalbums = pd.read_csv('../data/clean/api_albums_clean.csv', encoding='latin1')
spotifyalbums.head(3)

,albumnamers,albumidspotify,albumnamespotify,artistnamespotify,artistidspotify,releasedate,totaltracks
0,Sgt. Pepper's Lonely Hearts Club Band,1x1jpjDbetGqX0IKCUIBNj,Sgt. Pepper's Lonely Hearts Club Band,Bloco do Sargento Pimenta,3wGWCP3E3tYqj5memYV9Vq,2017-12-08,13.0
1,Pet Sounds,2CNEkSE8TADXRT2AzcEt1b,Pet Sounds,The Beach Boys,3oDbviiivRWhXwIE8hxkVV,1966-05-16,13.0
2,Revolver,0T1sskJDoybYGvPU5aw5Cf,REVOLVER,Lil Darkie,62F9BiUmjqeXbBztCwiX1U,2020-06-15,1.0

## Merge tables

In [193]:
sqltable_top500 = pd.merge(top500, spotifyalbums[['albumnamers', 'albumidspotify']], how='left', on='albumnamers')

In [194]:
sqltable_top500.head(2)

,toprankingorder,albumnamers,artist,year,albumidspotify
0,1,Sgt. Pepper's Lonely Hearts Club Band,The Beatles,1967,1x1jpjDbetGqX0IKCUIBNj
1,2,Pet Sounds,The Beach Boys,1966,2CNEkSE8TADXRT2AzcEt1b

In [195]:
sqltable_top500.shape

(500, 5)

## Clean NAs and duplicates

In [196]:
#clean NAs (some albums available in the RS DB were not found in Spotify)
sqltable_top500.dropna(inplace=True)

In [197]:
sqltable_top500.shape

(404, 5)

In [198]:
sqltable_top500.duplicated().any()

False

In [199]:
import re

# Iterate over each column in the DataFrame
for col in sqltable_top500.columns:
    sqltable_top500[col] = sqltable_top500[col].apply(lambda x: re.sub(r'[^\w\s]', '', x) if isinstance(x, str) else x)

# Display the updated DataFrame
sqltable_top500.head()

,toprankingorder,albumnamers,artist,year,albumidspotify
0,1,Sgt Peppers Lonely Hearts Club Band,The Beatles,1967,1x1jpjDbetGqX0IKCUIBNj
1,2,Pet Sounds,The Beach Boys,1966,2CNEkSE8TADXRT2AzcEt1b
2,3,Revolver,The Beatles,1966,0T1sskJDoybYGvPU5aw5Cf
3,4,Highway 61 Revisited,Bob Dylan,1965,6YabPKtZAjxwyWbuO9p4ZD
4,5,Rubber Soul,The Beatles,1965,5TIQEIzrI6RQfUVQ5Y571D

## Column names

In [200]:
sqltable_top500.columns

Index(['toprankingorder', 'albumnamers', 'artist', 'year', 'albumidspotify'], dtype='object')

In [201]:
finalcolumns = ['rs_toprankingorder', 'rs_albumname', 'rs_artist', 'rs_year', 'sp_albumid']

In [202]:
sqltable_top500.columns = finalcolumns

In [203]:
sqltable_top500.head(1)

,rs_toprankingorder,rs_albumname,rs_artist,rs_year,sp_albumid
0,1,Sgt Peppers Lonely Hearts Club Band,The Beatles,1967,1x1jpjDbetGqX0IKCUIBNj

## Reoder columns

In [204]:
sqltable_top500 = sqltable_top500.iloc[:, [4, 0, 1, 2, 3]]
sqltable_top500.head(1)

,sp_albumid,rs_toprankingorder,rs_albumname,rs_artist,rs_year
0,1x1jpjDbetGqX0IKCUIBNj,1,Sgt Peppers Lonely Hearts Club Band,The Beatles,1967

In [205]:
sqltable_top500['albums_sp_albumid'] = sqltable_top500['sp_albumid']

In [206]:
sqltable_top500.head()

,sp_albumid,rs_toprankingorder,rs_albumname,rs_artist,rs_year,albums_sp_albumid
0,1x1jpjDbetGqX0IKCUIBNj,1,Sgt Peppers Lonely Hearts Club Band,The Beatles,1967,1x1jpjDbetGqX0IKCUIBNj
1,2CNEkSE8TADXRT2AzcEt1b,2,Pet Sounds,The Beach Boys,1966,2CNEkSE8TADXRT2AzcEt1b
2,0T1sskJDoybYGvPU5aw5Cf,3,Revolver,The Beatles,1966,0T1sskJDoybYGvPU5aw5Cf
3,6YabPKtZAjxwyWbuO9p4ZD,4,Highway 61 Revisited,Bob Dylan,1965,6YabPKtZAjxwyWbuO9p4ZD
4,5TIQEIzrI6RQfUVQ5Y571D,5,Rubber Soul,The Beatles,1965,5TIQEIzrI6RQfUVQ5Y571D

## Data type

In [207]:
sqltable_top500.info()

<class 'pandas.core.frame.DataFrame'>
Index: 404 entries, 0 to 499
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   sp_albumid          404 non-null    object
 1   rs_toprankingorder  404 non-null    int64
 2   rs_albumname        404 non-null    object
 3   rs_artist           404 non-null    object
 4   rs_year             404 non-null    int64
 5   albums_sp_albumid   404 non-null    object
dtypes: int64(2), object(4)
memory usage: 22.1+ KB

In [208]:
sqltable_top500['rs_year'] = pd.to_datetime(sqltable_top500['rs_year'], format='%Y')

In [209]:
sqltable_top500['rs_year'].dtype

dtype('<M8[ns]')

## Export

In [210]:
import mysql.connector as conn
from sqlalchemy import create_engine

In [211]:
sqltable_top500.head(2)

,sp_albumid,rs_toprankingorder,rs_albumname,rs_artist,rs_year,albums_sp_albumid
0,1x1jpjDbetGqX0IKCUIBNj,1,Sgt Peppers Lonely Hearts Club Band,The Beatles,1967-01-01,1x1jpjDbetGqX0IKCUIBNj
1,2CNEkSE8TADXRT2AzcEt1b,2,Pet Sounds,The Beach Boys,1966-01-01,2CNEkSE8TADXRT2AzcEt1b

In [212]:
#with open('../pw.txt') as file: 
    
    #password = file.read()

In [213]:
#str_conn=f'mysql+pymysql://root:{password}@localhost:3306/rsalbums'

#cursor = create_engine(str_conn)

In [214]:
#sqltable_top500.to_sql(name='rstop500',
              #con=cursor,
              #if_exists = 'replace',
              #index=False)

404

In [215]:
sqltable_top500.to_csv('../data/sqlexports/sqltable_top500.csv', index=False, encoding='latin1')